vegeta/testcandidates/prisma/results/2018-07-08_20:26/albums_tracks_genre_some-150.txt
Requests      [total, rate]            9000, 150.02
Duration      [total, attack, wait]    1m0.004407016s, 59.993327204s, 11.079812ms
Latencies     [mean, 50, 95, 99, max]  10.29663ms, 9.771062ms, 13.517507ms, 16.916306ms, 54.059881ms
Bytes In      [total, mean]            60102000, 6678.00
Bytes Out     [total, mean]            2394000, 266.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:9000  
Error Set: