vegeta/testcandidates/prisma/results/2018-07-08_20:26/albums_tracks_genre_some-5.txt
Requests      [total, rate]            300, 5.02
Duration      [total, attack, wait]    59.809931947s, 59.7999999s, 9.932047ms
Latencies     [mean, 50, 95, 99, max]  10.343465ms, 10.08241ms, 12.234844ms, 13.507331ms, 14.760182ms
Bytes In      [total, mean]            2003400, 6678.00
Bytes Out     [total, mean]            79800, 266.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:300  
Error Set: